verification_run/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format ascii;
  class volScalarField;
  object omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions[0 0 - 1 0 0 0 0]; // Specific dissipation rate [1/s]

internalField uniform 1;

boundaryField {
  inlet {
    type fixedValue;
    value uniform 1;
  }

  outlet {
    type inletOutlet;
    inletValue uniform 1;
    value uniform 1;
  }

  bottom { type symmetryPlane; }

  top {
    type inletOutlet;
    inletValue uniform 1;
    value uniform 1;
  }

  side_left { type symmetryPlane; }

  side_right { type symmetryPlane; }
}

// ************************************************************************* //
