verification_run/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version 2.0;
  format ascii;
  class uniformDimensionedVectorField;
  location "constant";
  object g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions[0 1 - 2 0 0 0 0]; // [Mass Length Time Temperature Quantity Current
                             // Luminous] -> m/s^2
value(0 0 - 9.81);           // Gravity vector (0, 0, -g) [m/s^2]

// ************************************************************************* //
